LuckiBit/stm32-template/stm32f429ig/bootloader/core/stm32f4xx_hal_conf.h
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file    stm32f4xx_hal_conf_template.h
 * @author  MCD Application Team
 * @brief   HAL configuration template file.
 *          This file should be copied to the application folder and renamed
 *          to stm32f4xx_hal_conf.h.
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2017 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __STM32F4xx_HAL_CONF_H
#define __STM32F4xx_HAL_CONF_H

#ifdef __cplusplus
extern "C"
{
#endif

/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/

/* ########################## Module Selection ############################## */
/**
 * @brief This is the list of modules to be used in the HAL driver
 */
/* Module switches: 1 = enabled, 0 = disabled. */
#ifndef HAL_MODULE_ENABLE
#define HAL_MODULE_ENABLE 1
#endif
#ifndef HAL_CRYP_MODULE_ENABLE
#define HAL_CRYP_MODULE_ENABLE 0
#endif
#ifndef HAL_ADC_MODULE_ENABLE
#define HAL_ADC_MODULE_ENABLE 0
#endif
#ifndef HAL_CAN_MODULE_ENABLE
#define HAL_CAN_MODULE_ENABLE 0
#endif
#ifndef HAL_CRC_MODULE_ENABLE
#define HAL_CRC_MODULE_ENABLE 0
#endif
#ifndef HAL_CAN_LEGACY_MODULE_ENABLE
#define HAL_CAN_LEGACY_MODULE_ENABLE 0
#endif
#ifndef HAL_DAC_MODULE_ENABLE
#define HAL_DAC_MODULE_ENABLE 0
#endif
#ifndef HAL_DCMI_MODULE_ENABLE
#define HAL_DCMI_MODULE_ENABLE 0
#endif
#ifndef HAL_DMA2D_MODULE_ENABLE
#define HAL_DMA2D_MODULE_ENABLE 0
#endif
#ifndef HAL_ETH_MODULE_ENABLE
#define HAL_ETH_MODULE_ENABLE 0
#endif
#ifndef HAL_ETH_LEGACY_MODULE_ENABLE
#define HAL_ETH_LEGACY_MODULE_ENABLE 0
#endif
#ifndef HAL_NAND_MODULE_ENABLE
#define HAL_NAND_MODULE_ENABLE 0
#endif
#ifndef HAL_NOR_MODULE_ENABLE
#define HAL_NOR_MODULE_ENABLE 0
#endif
#ifndef HAL_PCCARD_MODULE_ENABLE
#define HAL_PCCARD_MODULE_ENABLE 0
#endif
#ifndef HAL_SRAM_MODULE_ENABLE
#define HAL_SRAM_MODULE_ENABLE 0
#endif
#ifndef HAL_SDRAM_MODULE_ENABLE
#define HAL_SDRAM_MODULE_ENABLE 0
#endif
#ifndef HAL_HASH_MODULE_ENABLE
#define HAL_HASH_MODULE_ENABLE 0
#endif
#ifndef HAL_I2C_MODULE_ENABLE
#define HAL_I2C_MODULE_ENABLE 0
#endif
#ifndef HAL_I2S_MODULE_ENABLE
#define HAL_I2S_MODULE_ENABLE 0
#endif
#ifndef HAL_IWDG_MODULE_ENABLE
#define HAL_IWDG_MODULE_ENABLE 0
#endif
#ifndef HAL_LTDC_MODULE_ENABLE
#define HAL_LTDC_MODULE_ENABLE 0
#endif
#ifndef HAL_RNG_MODULE_ENABLE
#define HAL_RNG_MODULE_ENABLE 0
#endif
#ifndef HAL_RTC_MODULE_ENABLE
#define HAL_RTC_MODULE_ENABLE 0
#endif
#ifndef HAL_SAI_MODULE_ENABLE
#define HAL_SAI_MODULE_ENABLE 0
#endif
#ifndef HAL_SD_MODULE_ENABLE
#define HAL_SD_MODULE_ENABLE 0
#endif
#ifndef HAL_MMC_MODULE_ENABLE
#define HAL_MMC_MODULE_ENABLE 0
#endif
#ifndef HAL_SPI_MODULE_ENABLE
#define HAL_SPI_MODULE_ENABLE 0
#endif
#ifndef HAL_TIM_MODULE_ENABLE
#define HAL_TIM_MODULE_ENABLE 0
#endif
#ifndef HAL_UART_MODULE_ENABLE
#define HAL_UART_MODULE_ENABLE 0
#endif
#ifndef HAL_USART_MODULE_ENABLE
#define HAL_USART_MODULE_ENABLE 0
#endif
#ifndef HAL_IRDA_MODULE_ENABLE
#define HAL_IRDA_MODULE_ENABLE 0
#endif
#ifndef HAL_SMARTCARD_MODULE_ENABLE
#define HAL_SMARTCARD_MODULE_ENABLE 0
#endif
#ifndef HAL_SMBUS_MODULE_ENABLE
#define HAL_SMBUS_MODULE_ENABLE 0
#endif
#ifndef HAL_WWDG_MODULE_ENABLE
#define HAL_WWDG_MODULE_ENABLE 0
#endif
#ifndef HAL_PCD_MODULE_ENABLE
#define HAL_PCD_MODULE_ENABLE 0
#endif
#ifndef HAL_HCD_MODULE_ENABLE
#define HAL_HCD_MODULE_ENABLE 0
#endif
#ifndef HAL_DSI_MODULE_ENABLE
#define HAL_DSI_MODULE_ENABLE 0
#endif
#ifndef HAL_QSPI_MODULE_ENABLE
#define HAL_QSPI_MODULE_ENABLE 0
#endif
#ifndef HAL_CEC_MODULE_ENABLE
#define HAL_CEC_MODULE_ENABLE 0
#endif
#ifndef HAL_FMPI2C_MODULE_ENABLE
#define HAL_FMPI2C_MODULE_ENABLE 0
#endif
#ifndef HAL_FMPSMBUS_MODULE_ENABLE
#define HAL_FMPSMBUS_MODULE_ENABLE 0
#endif
#ifndef HAL_SPDIFRX_MODULE_ENABLE
#define HAL_SPDIFRX_MODULE_ENABLE 0
#endif
#ifndef HAL_DFSDM_MODULE_ENABLE
#define HAL_DFSDM_MODULE_ENABLE 0
#endif
#ifndef HAL_LPTIM_MODULE_ENABLE
#define HAL_LPTIM_MODULE_ENABLE 0
#endif
#ifndef HAL_GPIO_MODULE_ENABLE
#define HAL_GPIO_MODULE_ENABLE 1
#endif
#ifndef HAL_EXTI_MODULE_ENABLE
#define HAL_EXTI_MODULE_ENABLE 1
#endif
#ifndef HAL_DMA_MODULE_ENABLE
#define HAL_DMA_MODULE_ENABLE 1
#endif
#ifndef HAL_RCC_MODULE_ENABLE
#define HAL_RCC_MODULE_ENABLE 1
#endif
#ifndef HAL_FLASH_MODULE_ENABLE
#define HAL_FLASH_MODULE_ENABLE 1
#endif
#ifndef HAL_PWR_MODULE_ENABLE
#define HAL_PWR_MODULE_ENABLE 1
#endif
#ifndef HAL_CORTEX_MODULE_ENABLE
#define HAL_CORTEX_MODULE_ENABLE 1
#endif

/* Module switches accept only boolean values. */
#if(HAL_MODULE_ENABLE != 0) && (HAL_MODULE_ENABLE != 1)
#error "HAL_MODULE_ENABLE must be 0 or 1"
#endif
#if(HAL_CRYP_MODULE_ENABLE != 0) && (HAL_CRYP_MODULE_ENABLE != 1)
#error "HAL_CRYP_MODULE_ENABLE must be 0 or 1"
#endif
#if(HAL_ADC_MODULE_ENABLE != 0) && (HAL_ADC_MODULE_ENABLE != 1)
#error "HAL_ADC_MODULE_ENABLE must be 0 or 1"
#endif
#if(HAL_CAN_MODULE_ENABLE != 0) && (HAL_CAN_MODULE_ENABLE != 1)
#error "HAL_CAN_MODULE_ENABLE must be 0 or 1"
#endif
#if(HAL_CRC_MODULE_ENABLE != 0) && (HAL_CRC_MODULE_ENABLE != 1)
#error "HAL_CRC_MODULE_ENABLE must be 0 or 1"
#endif
#if(HAL_CAN_LEGACY_MODULE_ENABLE != 0) && (HAL_CAN_LEGACY_MODULE_ENABLE != 1)
#error "HAL_CAN_LEGACY_MODULE_ENABLE must be 0 or 1"
#endif
#if(HAL_DAC_MODULE_ENABLE != 0) && (HAL_DAC_MODULE_ENABLE != 1)
#error "HAL_DAC_MODULE_ENABLE must be 0 or 1"
#endif
#if(HAL_DCMI_MODULE_ENABLE != 0) && (HAL_DCMI_MODULE_ENABLE != 1)
#error "HAL_DCMI_MODULE_ENABLE must be 0 or 1"
#endif
#if(HAL_DMA2D_MODULE_ENABLE != 0) && (HAL_DMA2D_MODULE_ENABLE != 1)
#error "HAL_DMA2D_MODULE_ENABLE must be 0 or 1"
#endif
#if(HAL_ETH_MODULE_ENABLE != 0) && (HAL_ETH_MODULE_ENABLE != 1)
#error "HAL_ETH_MODULE_ENABLE must be 0 or 1"
#endif
#if(HAL_ETH_LEGACY_MODULE_ENABLE != 0) && (HAL_ETH_LEGACY_MODULE_ENABLE != 1)
#error "HAL_ETH_LEGACY_MODULE_ENABLE must be 0 or 1"
#endif
#if(HAL_NAND_MODULE_ENABLE != 0) && (HAL_NAND_MODULE_ENABLE != 1)
#error "HAL_NAND_MODULE_ENABLE must be 0 or 1"
#endif
#if(HAL_NOR_MODULE_ENABLE != 0) && (HAL_NOR_MODULE_ENABLE != 1)
#error "HAL_NOR_MODULE_ENABLE must be 0 or 1"
#endif
#if(HAL_PCCARD_MODULE_ENABLE != 0) && (HAL_PCCARD_MODULE_ENABLE != 1)
#error "HAL_PCCARD_MODULE_ENABLE must be 0 or 1"
#endif
#if(HAL_SRAM_MODULE_ENABLE != 0) && (HAL_SRAM_MODULE_ENABLE != 1)
#error "HAL_SRAM_MODULE_ENABLE must be 0 or 1"
#endif
#if(HAL_SDRAM_MODULE_ENABLE != 0) && (HAL_SDRAM_MODULE_ENABLE != 1)
#error "HAL_SDRAM_MODULE_ENABLE must be 0 or 1"
#endif
#if(HAL_HASH_MODULE_ENABLE != 0) && (HAL_HASH_MODULE_ENABLE != 1)
#error "HAL_HASH_MODULE_ENABLE must be 0 or 1"
#endif
#if(HAL_I2C_MODULE_ENABLE != 0) && (HAL_I2C_MODULE_ENABLE != 1)
#error "HAL_I2C_MODULE_ENABLE must be 0 or 1"
#endif
#if(HAL_I2S_MODULE_ENABLE != 0) && (HAL_I2S_MODULE_ENABLE != 1)
#error "HAL_I2S_MODULE_ENABLE must be 0 or 1"
#endif
#if(HAL_IWDG_MODULE_ENABLE != 0) && (HAL_IWDG_MODULE_ENABLE != 1)
#error "HAL_IWDG_MODULE_ENABLE must be 0 or 1"
#endif
#if(HAL_LTDC_MODULE_ENABLE != 0) && (HAL_LTDC_MODULE_ENABLE != 1)
#error "HAL_LTDC_MODULE_ENABLE must be 0 or 1"
#endif
#if(HAL_RNG_MODULE_ENABLE != 0) && (HAL_RNG_MODULE_ENABLE != 1)
#error "HAL_RNG_MODULE_ENABLE must be 0 or 1"
#endif
#if(HAL_RTC_MODULE_ENABLE != 0) && (HAL_RTC_MODULE_ENABLE != 1)
#error "HAL_RTC_MODULE_ENABLE must be 0 or 1"
#endif
#if(HAL_SAI_MODULE_ENABLE != 0) && (HAL_SAI_MODULE_ENABLE != 1)
#error "HAL_SAI_MODULE_ENABLE must be 0 or 1"
#endif
#if(HAL_SD_MODULE_ENABLE != 0) && (HAL_SD_MODULE_ENABLE != 1)
#error "HAL_SD_MODULE_ENABLE must be 0 or 1"
#endif
#if(HAL_MMC_MODULE_ENABLE != 0) && (HAL_MMC_MODULE_ENABLE != 1)
#error "HAL_MMC_MODULE_ENABLE must be 0 or 1"
#endif
#if(HAL_SPI_MODULE_ENABLE != 0) && (HAL_SPI_MODULE_ENABLE != 1)
#error "HAL_SPI_MODULE_ENABLE must be 0 or 1"
#endif
#if(HAL_TIM_MODULE_ENABLE != 0) && (HAL_TIM_MODULE_ENABLE != 1)
#error "HAL_TIM_MODULE_ENABLE must be 0 or 1"
#endif
#if(HAL_UART_MODULE_ENABLE != 0) && (HAL_UART_MODULE_ENABLE != 1)
#error "HAL_UART_MODULE_ENABLE must be 0 or 1"
#endif
#if(HAL_USART_MODULE_ENABLE != 0) && (HAL_USART_MODULE_ENABLE != 1)
#error "HAL_USART_MODULE_ENABLE must be 0 or 1"
#endif
#if(HAL_IRDA_MODULE_ENABLE != 0) && (HAL_IRDA_MODULE_ENABLE != 1)
#error "HAL_IRDA_MODULE_ENABLE must be 0 or 1"
#endif
#if(HAL_SMARTCARD_MODULE_ENABLE != 0) && (HAL_SMARTCARD_MODULE_ENABLE != 1)
#error "HAL_SMARTCARD_MODULE_ENABLE must be 0 or 1"
#endif
#if(HAL_SMBUS_MODULE_ENABLE != 0) && (HAL_SMBUS_MODULE_ENABLE != 1)
#error "HAL_SMBUS_MODULE_ENABLE must be 0 or 1"
#endif
#if(HAL_WWDG_MODULE_ENABLE != 0) && (HAL_WWDG_MODULE_ENABLE != 1)
#error "HAL_WWDG_MODULE_ENABLE must be 0 or 1"
#endif
#if(HAL_PCD_MODULE_ENABLE != 0) && (HAL_PCD_MODULE_ENABLE != 1)
#error "HAL_PCD_MODULE_ENABLE must be 0 or 1"
#endif
#if(HAL_HCD_MODULE_ENABLE != 0) && (HAL_HCD_MODULE_ENABLE != 1)
#error "HAL_HCD_MODULE_ENABLE must be 0 or 1"
#endif
#if(HAL_DSI_MODULE_ENABLE != 0) && (HAL_DSI_MODULE_ENABLE != 1)
#error "HAL_DSI_MODULE_ENABLE must be 0 or 1"
#endif
#if(HAL_QSPI_MODULE_ENABLE != 0) && (HAL_QSPI_MODULE_ENABLE != 1)
#error "HAL_QSPI_MODULE_ENABLE must be 0 or 1"
#endif
#if(HAL_CEC_MODULE_ENABLE != 0) && (HAL_CEC_MODULE_ENABLE != 1)
#error "HAL_CEC_MODULE_ENABLE must be 0 or 1"
#endif
#if(HAL_FMPI2C_MODULE_ENABLE != 0) && (HAL_FMPI2C_MODULE_ENABLE != 1)
#error "HAL_FMPI2C_MODULE_ENABLE must be 0 or 1"
#endif
#if(HAL_FMPSMBUS_MODULE_ENABLE != 0) && (HAL_FMPSMBUS_MODULE_ENABLE != 1)
#error "HAL_FMPSMBUS_MODULE_ENABLE must be 0 or 1"
#endif
#if(HAL_SPDIFRX_MODULE_ENABLE != 0) && (HAL_SPDIFRX_MODULE_ENABLE != 1)
#error "HAL_SPDIFRX_MODULE_ENABLE must be 0 or 1"
#endif
#if(HAL_DFSDM_MODULE_ENABLE != 0) && (HAL_DFSDM_MODULE_ENABLE != 1)
#error "HAL_DFSDM_MODULE_ENABLE must be 0 or 1"
#endif
#if(HAL_LPTIM_MODULE_ENABLE != 0) && (HAL_LPTIM_MODULE_ENABLE != 1)
#error "HAL_LPTIM_MODULE_ENABLE must be 0 or 1"
#endif
#if(HAL_GPIO_MODULE_ENABLE != 0) && (HAL_GPIO_MODULE_ENABLE != 1)
#error "HAL_GPIO_MODULE_ENABLE must be 0 or 1"
#endif
#if(HAL_EXTI_MODULE_ENABLE != 0) && (HAL_EXTI_MODULE_ENABLE != 1)
#error "HAL_EXTI_MODULE_ENABLE must be 0 or 1"
#endif
#if(HAL_DMA_MODULE_ENABLE != 0) && (HAL_DMA_MODULE_ENABLE != 1)
#error "HAL_DMA_MODULE_ENABLE must be 0 or 1"
#endif
#if(HAL_RCC_MODULE_ENABLE != 0) && (HAL_RCC_MODULE_ENABLE != 1)
#error "HAL_RCC_MODULE_ENABLE must be 0 or 1"
#endif
#if(HAL_FLASH_MODULE_ENABLE != 0) && (HAL_FLASH_MODULE_ENABLE != 1)
#error "HAL_FLASH_MODULE_ENABLE must be 0 or 1"
#endif
#if(HAL_PWR_MODULE_ENABLE != 0) && (HAL_PWR_MODULE_ENABLE != 1)
#error "HAL_PWR_MODULE_ENABLE must be 0 or 1"
#endif
#if(HAL_CORTEX_MODULE_ENABLE != 0) && (HAL_CORTEX_MODULE_ENABLE != 1)
#error "HAL_CORTEX_MODULE_ENABLE must be 0 or 1"
#endif

/* Map module switches to the presence macros used by the HAL driver. */
#if HAL_MODULE_ENABLE
#define HAL_MODULE_ENABLED
#endif
#if HAL_CRYP_MODULE_ENABLE
#define HAL_CRYP_MODULE_ENABLED
#endif
#if HAL_ADC_MODULE_ENABLE
#define HAL_ADC_MODULE_ENABLED
#endif
#if HAL_CAN_MODULE_ENABLE
#define HAL_CAN_MODULE_ENABLED
#endif
#if HAL_CRC_MODULE_ENABLE
#define HAL_CRC_MODULE_ENABLED
#endif
#if HAL_CAN_LEGACY_MODULE_ENABLE
#define HAL_CAN_LEGACY_MODULE_ENABLED
#endif
#if HAL_DAC_MODULE_ENABLE
#define HAL_DAC_MODULE_ENABLED
#endif
#if HAL_DCMI_MODULE_ENABLE
#define HAL_DCMI_MODULE_ENABLED
#endif
#if HAL_DMA2D_MODULE_ENABLE
#define HAL_DMA2D_MODULE_ENABLED
#endif
#if HAL_ETH_MODULE_ENABLE
#define HAL_ETH_MODULE_ENABLED
#endif
#if HAL_ETH_LEGACY_MODULE_ENABLE
#define HAL_ETH_LEGACY_MODULE_ENABLED
#endif
#if HAL_NAND_MODULE_ENABLE
#define HAL_NAND_MODULE_ENABLED
#endif
#if HAL_NOR_MODULE_ENABLE
#define HAL_NOR_MODULE_ENABLED
#endif
#if HAL_PCCARD_MODULE_ENABLE
#define HAL_PCCARD_MODULE_ENABLED
#endif
#if HAL_SRAM_MODULE_ENABLE
#define HAL_SRAM_MODULE_ENABLED
#endif
#if HAL_SDRAM_MODULE_ENABLE
#define HAL_SDRAM_MODULE_ENABLED
#endif
#if HAL_HASH_MODULE_ENABLE
#define HAL_HASH_MODULE_ENABLED
#endif
#if HAL_I2C_MODULE_ENABLE
#define HAL_I2C_MODULE_ENABLED
#endif
#if HAL_I2S_MODULE_ENABLE
#define HAL_I2S_MODULE_ENABLED
#endif
#if HAL_IWDG_MODULE_ENABLE
#define HAL_IWDG_MODULE_ENABLED
#endif
#if HAL_LTDC_MODULE_ENABLE
#define HAL_LTDC_MODULE_ENABLED
#endif
#if HAL_RNG_MODULE_ENABLE
#define HAL_RNG_MODULE_ENABLED
#endif
#if HAL_RTC_MODULE_ENABLE
#define HAL_RTC_MODULE_ENABLED
#endif
#if HAL_SAI_MODULE_ENABLE
#define HAL_SAI_MODULE_ENABLED
#endif
#if HAL_SD_MODULE_ENABLE
#define HAL_SD_MODULE_ENABLED
#endif
#if HAL_MMC_MODULE_ENABLE
#define HAL_MMC_MODULE_ENABLED
#endif
#if HAL_SPI_MODULE_ENABLE
#define HAL_SPI_MODULE_ENABLED
#endif
#if HAL_TIM_MODULE_ENABLE
#define HAL_TIM_MODULE_ENABLED
#endif
#if HAL_UART_MODULE_ENABLE
#define HAL_UART_MODULE_ENABLED
#endif
#if HAL_USART_MODULE_ENABLE
#define HAL_USART_MODULE_ENABLED
#endif
#if HAL_IRDA_MODULE_ENABLE
#define HAL_IRDA_MODULE_ENABLED
#endif
#if HAL_SMARTCARD_MODULE_ENABLE
#define HAL_SMARTCARD_MODULE_ENABLED
#endif
#if HAL_SMBUS_MODULE_ENABLE
#define HAL_SMBUS_MODULE_ENABLED
#endif
#if HAL_WWDG_MODULE_ENABLE
#define HAL_WWDG_MODULE_ENABLED
#endif
#if HAL_PCD_MODULE_ENABLE
#define HAL_PCD_MODULE_ENABLED
#endif
#if HAL_HCD_MODULE_ENABLE
#define HAL_HCD_MODULE_ENABLED
#endif
#if HAL_DSI_MODULE_ENABLE
#define HAL_DSI_MODULE_ENABLED
#endif
#if HAL_QSPI_MODULE_ENABLE
#define HAL_QSPI_MODULE_ENABLED
#endif
#if HAL_CEC_MODULE_ENABLE
#define HAL_CEC_MODULE_ENABLED
#endif
#if HAL_FMPI2C_MODULE_ENABLE
#define HAL_FMPI2C_MODULE_ENABLED
#endif
#if HAL_FMPSMBUS_MODULE_ENABLE
#define HAL_FMPSMBUS_MODULE_ENABLED
#endif
#if HAL_SPDIFRX_MODULE_ENABLE
#define HAL_SPDIFRX_MODULE_ENABLED
#endif
#if HAL_DFSDM_MODULE_ENABLE
#define HAL_DFSDM_MODULE_ENABLED
#endif
#if HAL_LPTIM_MODULE_ENABLE
#define HAL_LPTIM_MODULE_ENABLED
#endif
#if HAL_GPIO_MODULE_ENABLE
#define HAL_GPIO_MODULE_ENABLED
#endif
#if HAL_EXTI_MODULE_ENABLE
#define HAL_EXTI_MODULE_ENABLED
#endif
#if HAL_DMA_MODULE_ENABLE
#define HAL_DMA_MODULE_ENABLED
#endif
#if HAL_RCC_MODULE_ENABLE
#define HAL_RCC_MODULE_ENABLED
#endif
#if HAL_FLASH_MODULE_ENABLE
#define HAL_FLASH_MODULE_ENABLED
#endif
#if HAL_PWR_MODULE_ENABLE
#define HAL_PWR_MODULE_ENABLED
#endif
#if HAL_CORTEX_MODULE_ENABLE
#define HAL_CORTEX_MODULE_ENABLED
#endif

/* ########################## HSE/HSI Values adaptation ##################### */
/**
 * @brief Adjust the value of External High Speed oscillator (HSE) used in your application.
 *        This value is used by the RCC HAL module to compute the system frequency
 *        (when HSE is used as system clock source, directly or through the PLL).
 */
#if !defined(HSE_VALUE)
#define HSE_VALUE 25000000U /*!< Value of the External oscillator in Hz */
#endif                      /* HSE_VALUE */

#if !defined(HSE_STARTUP_TIMEOUT)
#define HSE_STARTUP_TIMEOUT 100U /*!< Time out for HSE start up, in ms */
#endif                           /* HSE_STARTUP_TIMEOUT */

/**
 * @brief Internal High Speed oscillator (HSI) value.
 *        This value is used by the RCC HAL module to compute the system frequency
 *        (when HSI is used as system clock source, directly or through the PLL).
 */
#if !defined(HSI_VALUE)
#define HSI_VALUE ((uint32_t)16000000U) /*!< Value of the Internal oscillator in Hz*/
#endif                                  /* HSI_VALUE */

/**
 * @brief Internal Low Speed oscillator (LSI) value.
 */
#if !defined(LSI_VALUE)
#define LSI_VALUE 32000U /*!< LSI Typical Value in Hz*/
#endif /* LSI_VALUE */   /*!< Value of the Internal Low Speed oscillator in Hz                     \
                          The real value may vary depending on the variations                      \
                          in voltage and temperature.*/
/**
 * @brief External Low Speed oscillator (LSE) value.
 */
#if !defined(LSE_VALUE)
#define LSE_VALUE 32768U /*!< Value of the External Low Speed oscillator in Hz */
#endif                   /* LSE_VALUE */

#if !defined(LSE_STARTUP_TIMEOUT)
#define LSE_STARTUP_TIMEOUT 5000U /*!< Time out for LSE start up, in ms */
#endif                            /* LSE_STARTUP_TIMEOUT */

/**
 * @brief External clock source for I2S peripheral
 *        This value is used by the I2S HAL module to compute the I2S clock source
 *        frequency, this source is inserted directly through I2S_CKIN pad.
 */
#if !defined(EXTERNAL_CLOCK_VALUE)
#define EXTERNAL_CLOCK_VALUE 12288000U /*!< Value of the External audio frequency in Hz*/
#endif                                 /* EXTERNAL_CLOCK_VALUE */

